Revit 2027 API
ScheduleDefinition.RemoveSortGroupField Method
 Removes a sorting/grouping field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSortGroupField(
	int index
)
Public Sub RemoveSortGroupField (
	index As Integer
)
public:
void RemoveSortGroupField(
	int index
)
member RemoveSortGroupField :
        index : int -> unit
Parameters
index Int32
 The index of the sorting/grouping field to remove.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid sorting/grouping field index.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace